Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.ElementsAlreadyDisplacedInView
You cannot copy a displacement set into a view if one or several of its elements already belong to another displacement set.